{
  "modelTopology": {
    "keras_version": "2.2.2",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_1",
        "layers": [
          {
            "name": "input_2",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                3139
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_2"
            },
            "inbound_nodes": []
          },
          {
            "name": "input_3",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                383
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_3"
            },
            "inbound_nodes": []
          },
          {
            "name": "input_4",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                3105
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_4"
            },
            "inbound_nodes": []
          },
          {
            "name": "input_5",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [
                null,
                3217
              ],
              "dtype": "float32",
              "sparse": false,
              "name": "input_5"
            },
            "inbound_nodes": []
          },
          {
            "name": "dense_7",
            "class_name": "Dense",
            "config": {
              "name": "dense_7",
              "trainable": true,
              "units": 30,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dense_8",
            "class_name": "Dense",
            "config": {
              "name": "dense_8",
              "trainable": true,
              "units": 10,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_3",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dense_9",
            "class_name": "Dense",
            "config": {
              "name": "dense_9",
              "trainable": true,
              "units": 10,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_4",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dense_10",
            "class_name": "Dense",
            "config": {
              "name": "dense_10",
              "trainable": true,
              "units": 50,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "input_5",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "concatenate_1",
            "class_name": "Concatenate",
            "config": {
              "name": "concatenate_1",
              "trainable": true,
              "axis": -1
            },
            "inbound_nodes": [
              [
                [
                  "dense_7",
                  0,
                  0,
                  {}
                ],
                [
                  "dense_8",
                  0,
                  0,
                  {}
                ],
                [
                  "dense_9",
                  0,
                  0,
                  {}
                ],
                [
                  "dense_10",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "batch_normalization_2",
            "class_name": "BatchNormalization",
            "config": {
              "name": "batch_normalization_2",
              "trainable": true,
              "axis": -1,
              "momentum": 0.99,
              "epsilon": 0.001,
              "center": true,
              "scale": true,
              "beta_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "gamma_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "moving_mean_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "moving_variance_initializer": {
                "class_name": "Ones",
                "config": {}
              },
              "beta_regularizer": null,
              "gamma_regularizer": null,
              "beta_constraint": null,
              "gamma_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "concatenate_1",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "activation_2",
            "class_name": "Activation",
            "config": {
              "name": "activation_2",
              "trainable": true,
              "activation": "relu"
            },
            "inbound_nodes": [
              [
                [
                  "batch_normalization_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dense_11",
            "class_name": "Dense",
            "config": {
              "name": "dense_11",
              "trainable": true,
              "units": 100,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "activation_2",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dense_12",
            "class_name": "Dense",
            "config": {
              "name": "dense_12",
              "trainable": true,
              "units": 100,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "dense_11",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          },
          {
            "name": "dense_13",
            "class_name": "Dense",
            "config": {
              "name": "dense_13",
              "trainable": true,
              "units": 100,
              "activation": "linear",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": {
                "class_name": "Zeros",
                "config": {}
              },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [
              [
                [
                  "dense_11",
                  0,
                  0,
                  {}
                ]
              ]
            ]
          }
        ],
        "input_layers": [
          [
            "input_2",
            0,
            0
          ],
          [
            "input_3",
            0,
            0
          ],
          [
            "input_4",
            0,
            0
          ],
          [
            "input_5",
            0,
            0
          ]
        ],
        "output_layers": [
          [
            "dense_7",
            0,
            0
          ],
          [
            "dense_8",
            0,
            0
          ],
          [
            "dense_9",
            0,
            0
          ],
          [
            "dense_10",
            0,
            0
          ],
          [
            "concatenate_1",
            0,
            0
          ],
          [
            "dense_11",
            0,
            0
          ],
          [
            "dense_12",
            0,
            0
          ],
          [
            "dense_13",
            0,
            0
          ]
        ]
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of1"
      ],
      "weights": [
        {
          "name": "batch_normalization_2/gamma",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/beta",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_mean",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "batch_normalization_2/moving_variance",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_10/kernel",
          "shape": [
            3217,
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_10/bias",
          "shape": [
            50
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_11/kernel",
          "shape": [
            100,
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_11/bias",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_12/kernel",
          "shape": [
            100,
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_12/bias",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_13/kernel",
          "shape": [
            100,
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_13/bias",
          "shape": [
            100
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_7/kernel",
          "shape": [
            3139,
            30
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_7/bias",
          "shape": [
            30
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_8/kernel",
          "shape": [
            383,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_8/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_9/kernel",
          "shape": [
            3105,
            10
          ],
          "dtype": "float32"
        },
        {
          "name": "dense_9/bias",
          "shape": [
            10
          ],
          "dtype": "float32"
        }
      ]
    }
  ]
}